In [1]:
import pandas as pd

In [3]:
df7 = pd.read_csv('../batchs2/restaurant_1_week_007.csv')

In [7]:
df7.head()

,Order Number,Order Date,Item Name,Quantity,Product Price,Total products
0,1397,2015-02-10 14:38:00,Spicy Papadum,1,0.80,5
1,1403,2015-02-10 17:29:00,Paratha,1,2.95,9
2,1403,2015-02-10 17:29:00,Coke 1.5 ltr,1,2.95,9
3,1403,2015-02-10 17:29:00,Lemon Rice,1,3.95,9
4,1402,2015-02-10 16:39:00,Onion Bhaji,1,3.95,6

In [8]:
df7.describe()

       Order Number   Quantity  Product Price  Total products
count     19.000000  19.000000      19.000000       19.000000
mean    1398.736842   1.052632       5.994737        6.368421
std        5.300337   0.229416       4.072158        2.265944
min     1389.000000   1.000000       0.800000        2.000000
25%     1397.000000   1.000000       3.950000        5.000000
50%     1402.000000   1.000000       4.950000        6.000000
75%     1403.000000   1.000000       5.950000        9.000000
max     1403.000000   2.000000      17.950000        9.000000

In [13]:
df7.shape

(19, 6)

In [15]:
df7['Order Date'].max()

'2015-02-10 17:29:00'

In [16]:
df7['Order Date'].min()

'2015-02-10 10:29:00'